MarianoDel/emacs_lpc_test/src/lpc2294_reg.h
/* CAN CONTROLLERS AND ACCEPTANCE FILTER */
#define CAN1MOD 		(*((volatile unsigned long *) 0xE0044000))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1CMR 		(*((volatile unsigned long *) 0xE0044004))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1GSR 		(*((volatile unsigned long *) 0xE0044008))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1ICR 		(*((volatile unsigned long *) 0xE004400C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1IER 		(*((volatile unsigned long *) 0xE0044010))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1BTR 		(*((volatile unsigned long *) 0xE0044014))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1EWL 		(*((volatile unsigned long *) 0xE0044018))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1SR  		(*((volatile unsigned long *) 0xE004401C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1RFS 		(*((volatile unsigned long *) 0xE0044020))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1RID 		(*((volatile unsigned long *) 0xE0044024))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1RDA 		(*((volatile unsigned long *) 0xE0044028))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1RDB 		(*((volatile unsigned long *) 0xE004402C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1TFI1		(*((volatile unsigned long *) 0xE0044030))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1TID1		(*((volatile unsigned long *) 0xE0044034))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1TDA1		(*((volatile unsigned long *) 0xE0044038))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1TDB1		(*((volatile unsigned long *) 0xE004403C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1TFI2		(*((volatile unsigned long *) 0xE0044040))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1TID2		(*((volatile unsigned long *) 0xE0044044))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1TDA2		(*((volatile unsigned long *) 0xE0044048))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1TDB2		(*((volatile unsigned long *) 0xE004404C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1TFI3		(*((volatile unsigned long *) 0xE0044050))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1TID3		(*((volatile unsigned long *) 0xE0044054))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1TDA3		(*((volatile unsigned long *) 0xE0044058))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN1TDB3		(*((volatile unsigned long *) 0xE004405C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */

#define CAN2MOD 		(*((volatile unsigned long *) 0xE0048000))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2CMR 		(*((volatile unsigned long *) 0xE0048004))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2GSR 		(*((volatile unsigned long *) 0xE0048008))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2ICR 		(*((volatile unsigned long *) 0xE004800C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2IER 		(*((volatile unsigned long *) 0xE0048010))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2BTR 		(*((volatile unsigned long *) 0xE0048014))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2EWL 		(*((volatile unsigned long *) 0xE0048018))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2SR  		(*((volatile unsigned long *) 0xE004801C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2RFS 		(*((volatile unsigned long *) 0xE0048020))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2RID 		(*((volatile unsigned long *) 0xE0048024))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2RDA 		(*((volatile unsigned long *) 0xE0048028))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2RDB 		(*((volatile unsigned long *) 0xE004802C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2TFI1		(*((volatile unsigned long *) 0xE0048030))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2TID1		(*((volatile unsigned long *) 0xE0048034))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2TDA1		(*((volatile unsigned long *) 0xE0048038))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2TDB1		(*((volatile unsigned long *) 0xE004803C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2TFI2		(*((volatile unsigned long *) 0xE0048040))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2TID2		(*((volatile unsigned long *) 0xE0048044))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2TDA2		(*((volatile unsigned long *) 0xE0048048))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2TDB2		(*((volatile unsigned long *) 0xE004804C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2TFI3		(*((volatile unsigned long *) 0xE0048050))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2TID3		(*((volatile unsigned long *) 0xE0048054))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2TDA3		(*((volatile unsigned long *) 0xE0048058))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN2TDB3		(*((volatile unsigned long *) 0xE004805C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */

#define CAN3MOD 		(*((volatile unsigned long *) 0xE004C000))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3CMR 		(*((volatile unsigned long *) 0xE004C004))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3GSR 		(*((volatile unsigned long *) 0xE004C008))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3ICR 		(*((volatile unsigned long *) 0xE004C00C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3IER 		(*((volatile unsigned long *) 0xE004C010))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3BTR 		(*((volatile unsigned long *) 0xE004C014))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3EWL 		(*((volatile unsigned long *) 0xE004C018))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3SR  		(*((volatile unsigned long *) 0xE004C01C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3RFS 		(*((volatile unsigned long *) 0xE004C020))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3RID 		(*((volatile unsigned long *) 0xE004c024))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3RDA 		(*((volatile unsigned long *) 0xE004C028))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3RDB 		(*((volatile unsigned long *) 0xE004C02C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3TFI1		(*((volatile unsigned long *) 0xE004C030))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3TID1		(*((volatile unsigned long *) 0xE004C034))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3TDA1		(*((volatile unsigned long *) 0xE004C038))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3TDB1		(*((volatile unsigned long *) 0xE004C03C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3TFI2		(*((volatile unsigned long *) 0xE004C040))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3TID2		(*((volatile unsigned long *) 0xE004C044))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3TDA2		(*((volatile unsigned long *) 0xE004C048))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3TDB2		(*((volatile unsigned long *) 0xE004C04C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3TFI3		(*((volatile unsigned long *) 0xE004C050))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3TID3		(*((volatile unsigned long *) 0xE004C054))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3TDA3		(*((volatile unsigned long *) 0xE004C058))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN3TDB3		(*((volatile unsigned long *) 0xE004C05C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */

#define CAN4MOD 		(*((volatile unsigned long *) 0xE0050000))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4CMR 		(*((volatile unsigned long *) 0xE0050004))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4GSR 		(*((volatile unsigned long *) 0xE0050008))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4ICR 		(*((volatile unsigned long *) 0xE005000C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4IER 		(*((volatile unsigned long *) 0xE0050010))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4BTR 		(*((volatile unsigned long *) 0xE0050014))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4EWL 		(*((volatile unsigned long *) 0xE0050018))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4SR  		(*((volatile unsigned long *) 0xE005001C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4RFS 		(*((volatile unsigned long *) 0xE0050020))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4RID 		(*((volatile unsigned long *) 0xE0050024))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4RDA 		(*((volatile unsigned long *) 0xE0050028))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4RDB 		(*((volatile unsigned long *) 0xE005002C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4TFI1		(*((volatile unsigned long *) 0xE0050030))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4TID1		(*((volatile unsigned long *) 0xE0050034))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4TDA1		(*((volatile unsigned long *) 0xE0050038))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4TDB1		(*((volatile unsigned long *) 0xE005003C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4TFI2		(*((volatile unsigned long *) 0xE0050040))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4TID2		(*((volatile unsigned long *) 0xE0050044))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4TDA2		(*((volatile unsigned long *) 0xE0050048))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4TDB2		(*((volatile unsigned long *) 0xE005004C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4TFI3		(*((volatile unsigned long *) 0xE0050050))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4TID3		(*((volatile unsigned long *) 0xE0050054))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4TDA3		(*((volatile unsigned long *) 0xE0050058))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN4TDB3		(*((volatile unsigned long *) 0xE005005C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */

#define CAN5MOD 		(*((volatile unsigned long *) 0xE0054000))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5CMR 		(*((volatile unsigned long *) 0xE0054004))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5GSR 		(*((volatile unsigned long *) 0xE0054008))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5ICR 		(*((volatile unsigned long *) 0xE005400C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5IER 		(*((volatile unsigned long *) 0xE0054010))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5BTR 		(*((volatile unsigned long *) 0xE0054014))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5EWL 		(*((volatile unsigned long *) 0xE005401C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5SR  		(*((volatile unsigned long *) 0xE0054020))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5RFS 		(*((volatile unsigned long *) 0xE0054024))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5RDA 		(*((volatile unsigned long *) 0xE0054028))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5RDB 		(*((volatile unsigned long *) 0xE005402C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5TFI1		(*((volatile unsigned long *) 0xE0054030))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5TID1		(*((volatile unsigned long *) 0xE0054034))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5TDA1		(*((volatile unsigned long *) 0xE0054038))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5TDB1		(*((volatile unsigned long *) 0xE005403C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5TFI2		(*((volatile unsigned long *) 0xE0054040))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5TID2		(*((volatile unsigned long *) 0xE0054044))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5TDA2		(*((volatile unsigned long *) 0xE0054048))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5TDB2		(*((volatile unsigned long *) 0xE005404C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5TFI3		(*((volatile unsigned long *) 0xE0054050))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5TID3		(*((volatile unsigned long *) 0xE0054054))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5TDA3		(*((volatile unsigned long *) 0xE0054058))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CAN5TDB3		(*((volatile unsigned long *) 0xE005405C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */

