MarianoDel/emacs_lpc_test/src/lpc2294_reg.h
#define CAN6MOD 		(*((volatile unsigned long *) 0xE0058000))  	/* lpc2292\lpc2294 only */
#define CAN6CMR 		(*((volatile unsigned long *) 0xE0058004))  	/* lpc2292\lpc2294 only */
#define CAN6GSR 		(*((volatile unsigned long *) 0xE0058008))  	/* lpc2292\lpc2294 only */
#define CAN6ICR 		(*((volatile unsigned long *) 0xE005800C))  	/* lpc2292\lpc2294 only */
#define CAN6IER 		(*((volatile unsigned long *) 0xE0058010))  	/* lpc2292\lpc2294 only */
#define CAN6BTR 		(*((volatile unsigned long *) 0xE0058014))  	/* lpc2292\lpc2294 only */
#define CAN6EWL 		(*((volatile unsigned long *) 0xE005801C))  	/* lpc2292\lpc2294 only */
#define CAN6SR  		(*((volatile unsigned long *) 0xE0058020))  	/* lpc2292\lpc2294 only */
#define CAN6RFS 		(*((volatile unsigned long *) 0xE0058024))  	/* lpc2292\lpc2294 only */
#define CAN6RDA 		(*((volatile unsigned long *) 0xE0058028))  	/* lpc2292\lpc2294 only */
#define CAN6RDB 		(*((volatile unsigned long *) 0xE005802C))  	/* lpc2292\lpc2294 only */
#define CAN6TFI1		(*((volatile unsigned long *) 0xE0058030))  	/* lpc2292\lpc2294 only */
#define CAN6TID1		(*((volatile unsigned long *) 0xE0058034))  	/* lpc2292\lpc2294 only */
#define CAN6TDA1		(*((volatile unsigned long *) 0xE0058038))  	/* lpc2292\lpc2294 only */
#define CAN6TDB1		(*((volatile unsigned long *) 0xE005803C))  	/* lpc2292\lpc2294 only */
#define CAN6TFI2		(*((volatile unsigned long *) 0xE0058040))  	/* lpc2292\lpc2294 only */
#define CAN6TID2		(*((volatile unsigned long *) 0xE0058044))  	/* lpc2292\lpc2294 only */
#define CAN6TDA2		(*((volatile unsigned long *) 0xE0058048))  	/* lpc2292\lpc2294 only */
#define CAN6TDB2		(*((volatile unsigned long *) 0xE005804C))  	/* lpc2292\lpc2294 only */
#define CAN6TFI3		(*((volatile unsigned long *) 0xE0058050))  	/* lpc2292\lpc2294 only */
#define CAN6TID3		(*((volatile unsigned long *) 0xE0058054))  	/* lpc2292\lpc2294 only */
#define CAN6TDA3		(*((volatile unsigned long *) 0xE0058058))  	/* lpc2292\lpc2294 only */
#define CAN6TDB3		(*((volatile unsigned long *) 0xE005805C))  	/* lpc2292\lpc2294 only */

#define CANTxSR 		(*((volatile unsigned long *) 0xE0040000))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CANRxSR 		(*((volatile unsigned long *) 0xE0040004))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CANMSR  		(*((volatile unsigned long *) 0xE0040008))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */

#define CANAFMR 		(*((volatile unsigned long *) 0xE003C000))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CANSFF_sa   	(*((volatile unsigned long *) 0xE003C004))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CANSFF_GRP_sa   (*((volatile unsigned long *) 0xE003C008))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CANEFF_sa   	(*((volatile unsigned long *) 0xE003C00C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CANEFF_GRP_sa   (*((volatile unsigned long *) 0xE003C010))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CANENDofTable   (*((volatile unsigned long *) 0xE003C014))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CANLUTerrAd 	(*((volatile unsigned long *) 0xE003C018))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
#define CANLUTerr   	(*((volatile unsigned long *) 0xE003C01C))  	/* lpc2119\lpc2129\lpc2292\lpc2294 only */
/* CAN Acceptance Filter RAM */
#define CANAFRAM		(*((volatile unsigned long *) 0xE0038000))


/* Timer 0 */
#define T0IR			(*((volatile unsigned long *) 0xE0004000))
#define T0TCR   		(*((volatile unsigned long *) 0xE0004004))
#define T0TC			(*((volatile unsigned long *) 0xE0004008))
#define T0PR			(*((volatile unsigned long *) 0xE000400C))
#define T0PC			(*((volatile unsigned long *) 0xE0004010))
#define T0MCR   		(*((volatile unsigned long *) 0xE0004014))
#define T0MR0   		(*((volatile unsigned long *) 0xE0004018))
#define T0MR1   		(*((volatile unsigned long *) 0xE000401C))
#define T0MR2   		(*((volatile unsigned long *) 0xE0004020))
#define T0MR3   		(*((volatile unsigned long *) 0xE0004024))
#define T0CCR   		(*((volatile unsigned long *) 0xE0004028))
#define T0CR0   		(*((volatile unsigned long *) 0xE000402C))
#define T0CR1   		(*((volatile unsigned long *) 0xE0004030))
#define T0CR2   		(*((volatile unsigned long *) 0xE0004034))
#define T0CR3   		(*((volatile unsigned long *) 0xE0004038))
#define T0EMR   		(*((volatile unsigned long *) 0xE000403C))

/* Timer 1 */
#define T1IR			(*((volatile unsigned long *) 0xE0008000))
#define T1TCR   		(*((volatile unsigned long *) 0xE0008004))
#define T1TC			(*((volatile unsigned long *) 0xE0008008))
#define T1PR			(*((volatile unsigned long *) 0xE000800C))
#define T1PC			(*((volatile unsigned long *) 0xE0008010))
#define T1MCR   		(*((volatile unsigned long *) 0xE0008014))
#define T1MR0   		(*((volatile unsigned long *) 0xE0008018))
#define T1MR1   		(*((volatile unsigned long *) 0xE000801C))
#define T1MR2   		(*((volatile unsigned long *) 0xE0008020))
#define T1MR3   		(*((volatile unsigned long *) 0xE0008024))
#define T1CCR   		(*((volatile unsigned long *) 0xE0008028))
#define T1CR0   		(*((volatile unsigned long *) 0xE000802C))
#define T1CR1   		(*((volatile unsigned long *) 0xE0008030))
#define T1CR2   		(*((volatile unsigned long *) 0xE0008034))
#define T1CR3   		(*((volatile unsigned long *) 0xE0008038))
#define T1EMR   		(*((volatile unsigned long *) 0xE000803C))

/* Pulse Width Modulator (PWM) */
#define PWMIR   		(*((volatile unsigned long *) 0xE0014000))
#define PWMTCR  		(*((volatile unsigned long *) 0xE0014004))
#define PWMTC   		(*((volatile unsigned long *) 0xE0014008))
#define PWMPR   		(*((volatile unsigned long *) 0xE001400C))
#define PWMPC   		(*((volatile unsigned long *) 0xE0014010))
#define PWMMCR  		(*((volatile unsigned long *) 0xE0014014))
#define PWMMR0  		(*((volatile unsigned long *) 0xE0014018))
#define PWMMR1  		(*((volatile unsigned long *) 0xE001401C))
#define PWMMR2  		(*((volatile unsigned long *) 0xE0014020))
#define PWMMR3  		(*((volatile unsigned long *) 0xE0014024))
#define PWMMR4  		(*((volatile unsigned long *) 0xE0014040))
#define PWMMR5  		(*((volatile unsigned long *) 0xE0014044))
#define PWMMR6  		(*((volatile unsigned long *) 0xE0014048))
#define PWMPCR  		(*((volatile unsigned long *) 0xE001404C))
#define PWMLER  		(*((volatile unsigned long *) 0xE0014050))

/* A/D CONVERTER */
#define ADCR			(*((volatile unsigned long *) 0xE0034000))  	/* no in lpc210x*/
#define ADDR			(*((volatile unsigned long *) 0xE0034004))  	/* no in lpc210x*/

